#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
cloudflare_zone.kacpermalachowski: Refreshing state... [id=719d0307f56dd61e2a0a1a06f8c3a6e5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_record.api_record will be created
  + resource "cloudflare_record" "api_record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "719d0307f56dd61e2a0a1a06f8c3a6e5"
    }

  # cloudflare_record.api_www_record will be created
  + resource "cloudflare_record" "api_www_record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www.api"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "719d0307f56dd61e2a0a1a06f8c3a6e5"
    }

  # cloudflare_record.website_record will be created
  + resource "cloudflare_record" "website_record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "719d0307f56dd61e2a0a1a06f8c3a6e5"
    }

  # cloudflare_record.website_www_record will be created
  + resource "cloudflare_record" "website_www_record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "719d0307f56dd61e2a0a1a06f8c3a6e5"
    }

  # cloudflare_zone.kacpermalachowski will be updated in-place
  ~ resource "cloudflare_zone" "kacpermalachowski" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ account_id          = (sensitive value)
        id                  = "719d0307f56dd61e2a0a1a06f8c3a6e5"
        # (8 unchanged attributes hidden)
    }

  # google_cloud_run_service.api_server will be created
  + resource "google_cloud_run_service" "api_server" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "eu-central2"
      + name                       = "api-server"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "ghcr.io/kacpermalachowski/blog/server:main"
                  + name  = (known after apply)
                }
            }
        }
    }

  # google_cloud_run_service.website will be created
  + resource "google_cloud_run_service" "website" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "eu-central2"
      + name                       = "website"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "ghcr.io/kacpermalachowski/blog/client:main"
                  + name  = (known after apply)
                }
            }
        }
    }

  # google_firestore_database.database will be created
  + resource "google_firestore_database" "database" {
      + app_engine_integration_mode = (known after apply)
      + concurrency_mode            = (known after apply)
      + create_time                 = (known after apply)
      + etag                        = (known after apply)
      + id                          = (known after apply)
      + key_prefix                  = (known after apply)
      + location_id                 = "nam5"
      + name                        = "(default)"
      + project                     = (known after apply)
      + type                        = "FIRESTORE_NATIVE"
    }

  # google_project_service.firestore will be created
  + resource "google_project_service" "firestore" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "firestore.googleapis.com"
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @KacperMalachowski, Action: `pull_request`*